app/controllers/apartments_controller.rb

  def create
    user_id = current_user.id
    params[:apartment][:user_id] = user_id
    price = params[:apartment][:price]
    params[:apartment][:price] = Apartment.parsePrice(price)
    street_address = params[:apartment][:street_address]
    apartment_number = params[:apartment][:apartment_number]

=begin
    title = params[:apartment][:title]
    city = params[:apartment][:city]
    state = params[:apartment][:state]
    zip = params[:apartment][:zip]
    desc = params[:apartment][:description]
    price = params[:apartment][:price]
    params[:apartment][:price] = Apartment.parsePrice(price)
    beds = params[:apartment][:bedrooms]
    baths = params[:apartment][:bathrooms]
    street_address = params[:street_address]
    apartment_number = params[:apartment_number]
    @apartment = Apartment.add(user_id, title, street_address, apartment_number, city, state, zip, desc, price, beds, baths)
=end

    @apartment = Apartment.new(apt_params)
    if Apartment.where('street_address = ? AND apartment_number = ?', street_address, apartment_number).empty?
      if @apartment.save
---
SELECT 1 AS one FROM "apartments" WHERE "apartments"."address" = '111 bancroft avenue' LIMIT 1
INSERT INTO "apartments" ("address", "bathrooms", "bedrooms", "created_at", "description", "price", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def search
    @search = Apartment.search do |query|
---
SELECT "apartments".* FROM "apartments" WHERE (address LIKE '%bancroft%')