app/views/apartments/search.html.erb

              </script>
              <% if current_user.flagged?(Apartment.find(apt.id))  %>
---
SELECT "apartments".* FROM "apartments" WHERE (address LIKE '%bancroft%')